<?php
	/**
	 * Created by PhpStorm.
	 * User: AlexN
	 * Date: 06.02.2016
	 * Time: 15:22
	 */
	/*
	 2. Создать форму с элементом textarea. При отправке формы скрипт должен выдавать ТОП3
	длинных слов в тексте. Реализовать с помощью функции.</p>
	*/
	?>

<form action="2-1.php" method="post">
	<textarea name="textarea1" id="ta" cols="30" rows="10">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты).</textarea>
	<br>
	<button type="submit">Отправить</button>
</form>